<a href="https://colab.research.google.com/github/MJanbandhu/My-Practice/blob/main/Pandas_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

- pandas -- Panel Data
- Any data used for research or study purposes
- Objects --> 1 .Series -- 1 Column Multiple rows
              2. Data Frame -- multiple rows and columns
- Built on numpy

In [ ]:
import pandas as pd

## Series

In [ ]:
## Creating empty series
d=pd.Series()

C:\Users\Datamites\AppData\Local\Temp\ipykernel_868\779336895.py:2: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  d=pd.Series()

In [ ]:
d

Series([], dtype: float64)

In [ ]:
type(d)

pandas.core.series.Series

In [ ]:
## Creating series with one element
d=pd.Series(17)

In [ ]:
d

0    17
dtype: int64

In [ ]:
## Creating series using tuple
t=(10,11,12)
d=pd.Series(t)
d

0    10
1    11
2    12
dtype: int64

In [ ]:
##  creating series using list
l1=[45,78,56,445,78]
d=pd.Series(l1)
d

0     45
1     78
2     56
3    445
4     78
dtype: int64

In [ ]:
## Creating series with array
import numpy as np
arr=np.array([1,2,3,4])
d1=pd.Series(arr)
d1

0    1
1    2
2    3
3    4
dtype: int32

In [ ]:
arr2= np.array([[1,2],[3,4],[5,6]])
arr2.shape

(3, 2)

In [ ]:
s2 = pd.Series(arr2) #Data should be 1 diementional in series

ValueError: Data must be 1-dimensional

In [ ]:
import pandas as pd

In [ ]:
## Using dictionary
d={'a':1,'b':2,'c':3,'d':4}

In [ ]:
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [ ]:
d.values()

dict_values([1, 2, 3, 4])

In [ ]:
d.keys()

dict_keys(['a', 'b', 'c', 'd'])

In [ ]:
d['a']

1

In [ ]:
b=pd.Series(d)

In [ ]:
b

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
d=pd.Series([1,2,3,5,47,58,98,7,8,6,32,78,2,8,289,258,78])
print(d)#,end=" ")

0       1
1       2
2       3
3       5
4      47
5      58
6      98
7       7
8       8
9       6
10     32
11     78
12      2
13      8
14    289
15    258
16     78
dtype: int64

In [ ]:
b[2]  # Using default index location

3

In [ ]:
import numpy as np

In [ ]:
arr_2=np.array([1,2,3])
s_2=pd.Series(arr_2,index=['ab','bc','cd'])
s_2

ab    1
bc    2
cd    3
dtype: int32

In [ ]:
## Slicing operation
d=pd.Series([1,2,3,5,47,98,7,8,6,32,78,2,8,289,258,78])
d

0       1
1       2
2       3
3       5
4      47
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [ ]:
d[4:9]

4    47
5    98
6     7
7     8
8     6
dtype: int64

In [ ]:
d[0:13:3] # Slicing with step

0      1
3      5
6      7
9     32
12     8
dtype: int64

In [ ]:
d[[7,2,3,5]] ## extracting elements from multiple index

7     8
2     3
3     5
5    98
dtype: int64

In [ ]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6       7
7       8
8       6
9      32
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

In [ ]:
d[4]=34  ## changing the element

In [ ]:
d

In [ ]:
d[6:10]=[100,200,300,400]

In [ ]:
d

0       1
1       2
2       3
3       5
4      34
5      98
6     100
7     200
8     300
9     400
10     78
11      2
12      8
13    289
14    258
15     78
dtype: int64

## DataFrame

In [ ]:
## empty dataframe
d=pd.DataFrame()

In [ ]:
print(d)

Empty DataFrame
Columns: []
Index: []

In [ ]:
type(d)

pandas.core.frame.DataFrame

In [ ]:
## using nested list
data=[[1,2,3,4],[14,12,1,'a',8],[7,8,9]]

In [ ]:
## using nested list
data=[[1,2,3,4],[14,12,1,'a',8],[7,8,9]]

In [ ]:
d

    0   1  2     3    4
0   1   2  3     4  NaN
1  14  12  1     a  8.0
2   7   8  9  None  NaN

In [ ]:
data=[['abc',1],['def',2],['ghi',3],['hij'],['klm','5']]

In [ ]:
a=pd.DataFrame(data)

In [ ]:
a

     0    1
0  abc  1.0
1  def  2.0
2  ghi  3.0
3  hij  NaN
4  klm  5.0

In [ ]:
#d=pd.DataFrame(data,columns=['A','B','C','D','E']) ## changing the column

In [ ]:
d=pd.DataFrame(data,columns=['A','B'],index=['A','B','C','D','E'])  ## changing the index

In [ ]:
d

     A    B
A  abc  1.0
B  def  2.0
C  ghi  3.0
D  hij  NaN
E  klm  5.0

In [ ]:
## dataframe using dictonary
data={'name':['a','b','c','d','e','f'],'age':[45,12,48,25,12,56]}

In [ ]:
d=pd.DataFrame(data)#,columns=['Name','Age'])

In [ ]:
d

  name  age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [ ]:
d.rename({'name':'Name','age':"Age"},axis=1,inplace=True)

In [ ]:
d

  Name  Age
0    a   45
1    b   12
2    c   48
3    d   25
4    e   12
5    f   56

In [ ]:
## Accessing the elements from dataframe
data=[['ALex',10,'Maths'],['Bob',12,'Science'],['Kelly',15,'Eco'],
      ['Boris',14,'Geo'],['Ken',18,'English']]

In [ ]:
data

[['ALex', 10, 'Maths'],
 ['Bob', 12, 'Science'],
 ['Kelly', 15, 'Eco'],
 ['Boris', 14, 'Geo'],
 ['Ken', 18, 'English']]

In [ ]:
d=pd.DataFrame(data,columns=['Name','Age','Subject'])

In [ ]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
## Accessing single column
d['Name']

0     ALex
1      Bob
2    Kelly
3    Boris
4      Ken
Name: Name, dtype: object

In [ ]:
## Accessing multiple column
d[['Name','Subject']]

    Name  Subject
0   ALex    Maths
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo
4    Ken  English

In [ ]:
d[1] ##to access single row

KeyError: 1

In [ ]:
d.loc[1]

Name           Bob
Age             12
Subject    Science
Name: 1, dtype: object

In [ ]:
d.loc[[0,1]]  #accessing multiple rows

   Name  Age  Subject
0  ALex   10    Maths
1   Bob   12  Science

In [ ]:
# filtering data with perticular rows and column
d.loc[0:2,['Age','Subject']]
# loc takes name of columns as well upper limit

   Age  Subject
0   10    Maths
1   12  Science
2   15      Eco

In [ ]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
d[[1,2]]

KeyError: "None of [Int64Index([1, 2], dtype='int64')] are in the [columns]"

In [ ]:
d.iloc[1:4,[0,2]]    #iloc works only with index of column
# iloc exclude upper limit

    Name  Subject
1    Bob  Science
2  Kelly      Eco
3  Boris      Geo

In [ ]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
d.iloc[1,2]

'Science'

In [ ]:
d.iloc[3,1]

14

In [ ]:
# to access the single element we use iloc
d.iloc[1,2]

'Science'

In [ ]:
d

    Name  Age  Subject
0   ALex   10    Maths
1    Bob   12  Science
2  Kelly   15      Eco
3  Boris   14      Geo
4    Ken   18  English

In [ ]:
d['Gender'] = ['M','M','F','F','F'] # initialize and add a new column to the DataFrame
d

    Name  Age  Subject Gender
0   ALex   10    Maths      M
1    Bob   12  Science      M
2  Kelly   15      Eco      F
3  Boris   14      Geo      F
4    Ken   18  English      F

In [ ]:
d['Age']=d['Age']+ 2 # broadcasting

In [ ]:
d

    Name  Age  Subject Gender
0   ALex   26    Maths      M
1    Bob   30  Science      M
2  Kelly   36      Eco      F
3  Boris   34      Geo      F
4    Ken   42  English      F